Revit 2027 API
ElementTransformUtils.CopyElements Method
Overload List
Name | Description
CopyElements(Document, ICollection<ElementId>, XYZ) |  Copies a set of elements and places the copies at a location indicated by a given translation.
CopyElements(Document, ICollection<ElementId>, Document, Transform, CopyPasteOptions) |  Copies a set of elements from source document to destination document.
CopyElements(View, ICollection<ElementId>, View, Transform, CopyPasteOptions) |  Copies a set of elements from source view to destination view.
Top
See Also
Reference
ElementTransformUtils Class
Autodesk.Revit.DB Namespace